[
  {
    "timestamp": "2025-07-26T22:32:36.605454",
    "text": "Power firm donates fuel to boost disaster response in N. Luzon | Philippine News Agency Power firm donates fuel to boost disaster response in N. Luzon | Philippine News Agency FUEL AID. Aboitiz Renewables donates 4,400 liters of fuel to Benguet and Mountain Province, home to its nine hydropower facilities, on Friday (July 26, 2025). La Trinidad Mayor Roderick Awingan called the assistance “a lifeline,” enabling quicker road clearing and faster recovery for affected communities. (Photo by Aboitiz Renewables)\n\nBAGUIO CITY – Aboitiz Power has donated 4,400 liters of fuel to local gove...",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.52,
    "user_comment": "",
    "processed_text": "power firm donat fuel boost disast respons n luzon philippin news agenc power firm donat fuel boost disast respons n luzon philippin news agenc fuel aid aboitiz renew donat liter fuel benguet mountain provinc home nine hydropow facil friday juli la trinidad mayor roderick awingan call assist lifelin enabl quicker road clear faster recoveri affect commun photo aboitiz renew baguio citi aboitiz power donat liter fuel local gove",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:32:50.369768",
    "text": "PH issues advisory vs. travel to 7 Thai border provinces | Philippine News Agency PH issues advisory vs. travel to 7 Thai border provinces | Philippine News Agency MANILA – The Philippine Embassy in Bangkok advised Filipinos against traveling to seven Thai provinces – Ubon Ratchatani, Si Sa Ket, Surin, Sa Kaeo, Buri Ram, Chantaburi, and Trat – as the deadly border clashes between Thailand and Cambodia entered their third day.“Travel by Filipinos to the aforementioned provinces is highly discouraged due to the ongoing situation,” the embassy said in a statement on Saturday.“Th...",
    "predicted_label": "Fake",
    "actual_label": "Real",
    "confidence": 0.56,
    "user_comment": "",
    "processed_text": "ph issu advisori vs travel thai border provinc philippin news agenc ph issu advisori vs travel thai border provinc philippin news agenc manila philippin embassi bangkok advis filipino travel seven thai provinc ubon ratchatani si sa ket surin sa kaeo buri ram chantaburi trat deadli border clash thailand cambodia enter third daytravel filipino aforement provinc highli discourag due ongo situat embassi said statement saturdayth",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:32:59.795758",
    "text": "PBBM conducts aerial inspection of flood-hit Pampanga | Philippine News Agency PBBM conducts aerial inspection of flood-hit Pampanga | Philippine News Agency AERIAL INSPECTION. President Ferdinand R. Marcos Jr. conducts an aerial inspection of flood-hit areas in Pampanga on Saturday (July 26, 2025). Marcos’ scheduled visit to an evacuation center in Bacolor, Pampanga earlier in the day did not push through due to inclement weather. (Photo from the Presidential Communications Office)\n\nMANILA – President Ferdinand R. Marcos Jr. on Saturday conducted an aerial inspection of f...",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.58,
    "user_comment": "",
    "processed_text": "pbbm conduct aerial inspect floodhit pampanga philippin news agenc pbbm conduct aerial inspect floodhit pampanga philippin news agenc aerial inspect presid ferdinand r marco jr conduct aerial inspect floodhit area pampanga saturday juli marco schedul visit evacu center bacolor pampanga earlier day push due inclement weather photo presidenti commun offic manila presid ferdinand r marco jr saturday conduct aerial inspect f",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:33:09.855551",
    "text": "7 Chinese nabbed in CDO over alleged illegal mining ops | Philippine News Agency 7 Chinese nabbed in CDO over alleged illegal mining ops | Philippine News Agency NABBED FOR ILLEGAL MINING. Local authorities apprehend seven Chinese nationals during an environmental law enforcement operation in Barangay Tuburan, Cagayan de Oro City on July 23, 2025. The seven allegedly violated multiple environmental laws, including the Philippine Mining Act. (Photo courtesy of DENR)\n\nMANILA – Seven Chinese nationals were arrested in Cagayan de Oro City on July 23 for alleged violation of mult...",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.52,
    "user_comment": "",
    "processed_text": "chines nab cdo alleg illeg mine op philippin news agenc chines nab cdo alleg illeg mine op philippin news agenc nab illeg mine local author apprehend seven chines nation environment law enforc oper barangay tuburan cagayan de oro citi juli seven allegedli violat multipl environment law includ philippin mine act photo courtesi denr manila seven chines nation arrest cagayan de oro citi juli alleg violat mult",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:33:22.050033",
    "text": "Security preps all set for SONA; 3 groups cleared to hold rallies | Philippine News Agency Security preps all set for SONA; 3 groups cleared to hold rallies | Philippine News Agency (PNA file photo)\n\nMANILA – The Philippine National Police (PNP) on Saturday confirmed that security preparations are in place for President Ferdinand R. Marcos Jr.’s State of the Nation Address (SONA) on Monday, and three groups have been granted permits to stage protest rallies.In a radio interview, PNP spokesperson Brig. Gen. Jean Fajardo said permits were issued to militant group Bayan, which will hold ...",
    "predicted_label": "Fake",
    "actual_label": "Real",
    "confidence": 0.58,
    "user_comment": "",
    "processed_text": "secur prep set sona group clear hold ralli philippin news agenc secur prep set sona group clear hold ralli philippin news agenc pna file photo manila philippin nation polic pnp saturday confirm secur prepar place presid ferdinand r marco jr state nation address sona monday three group grant permit stage protest ralliesin radio interview pnp spokesperson brig gen jean fajardo said permit issu milit group bayan hold",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:34:19.896411",
    "text": "MMDA to set zipper lane on Elliptical-Commonwealth for SONA | Philippine News Agency MMDA to set zipper lane on Elliptical-Commonwealth for SONA | Philippine News Agency ALTERNATE ROUTES. The Metropolitan Manila Development Authority (MMDA) on Friday (July 25, 2025) releases alternate routes for motorists for Monday’s State of the Nation Address (SONA) of President Ferdinand R. Marcos Jr. The MMDA provided alternative routes in addition to a ‘no-day-off, no-absent’ policy to ensure the strong presence of traffic enforcers and emergency personnel in the National Capital Region. (...",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.52,
    "user_comment": "",
    "processed_text": "mmda set zipper lane ellipticalcommonwealth sona philippin news agenc mmda set zipper lane ellipticalcommonwealth sona philippin news agenc altern rout metropolitan manila develop author mmda friday juli releas altern rout motorist monday state nation address sona presid ferdinand r marco jr mmda provid altern rout addit nodayoff noabsent polici ensur strong presenc traffic enforc emerg personnel nation capit region",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:34:41.176918",
    "text": "Marcos admin unwavering in asserting PH rights over WPS | Philippine News Agency Marcos admin unwavering in asserting PH rights over WPS | Philippine News Agency STEADY PROGRESS. President Ferdinand R. Marcos Jr. delivers his 3rd State of the Nation Address (SONA) at the Batasang Pambansa in Quezon City on July 22, 2024. Malacañang on July 15, 2025 said President Marcos would draft his 4th SONA set on July 28. (PNA photo by Joan Bondoc)\n\nMANILA – The Philippines will neither yield nor waver in asserting its rights and interests over the West Philippine Sea.This was the commi...",
    "predicted_label": "Fake",
    "actual_label": "Real",
    "confidence": 0.69,
    "user_comment": "",
    "processed_text": "marco admin unwav assert ph right wp philippin news agenc marco admin unwav assert ph right wp philippin news agenc steadi progress presid ferdinand r marco jr deliv rd state nation address sona batasang pambansa quezon citi juli malacaang juli said presid marco would draft th sona set juli pna photo joan bondoc manila philippin neither yield waver assert right interest west philippin seathi commi",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:34:47.733838",
    "text": "SHFC enhances community mortgage program for low-income families | Philippine News Agency SHFC enhances community mortgage program for low-income families | Philippine News Agency HOUSING PROJECT. The Palayan City Township Housing Project in Brgy. Atate, Palayan City, Nueva Ecija, in this photo taken May 5, 2025. Social Housing Finance Corporation President and Chief Executive Officer Federico Laxa on Monday (July 21, 2025) relaunched its Community Mortgage Program to provide additional help for low-income families needing housing. (Photo courtesy of Speaker Ferdinand Martin Romualde...",
    "predicted_label": "Fake",
    "actual_label": "Real",
    "confidence": 0.58,
    "user_comment": "",
    "processed_text": "shfc enhanc commun mortgag program lowincom famili philippin news agenc shfc enhanc commun mortgag program lowincom famili philippin news agenc hous project palayan citi township hous project brgi atat palayan citi nueva ecija photo taken may social hous financ corpor presid chief execut offic federico laxa monday juli relaunch commun mortgag program provid addit help lowincom famili need hous photo courtesi speaker ferdinand martin romuald",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:35:00.362783",
    "text": "Expanded benefits ease burden of Region 8 dialysis patients | Philippine News Agency Expanded benefits ease burden of Region 8 dialysis patients | Philippine News Agency EXPANDED COVERAGE. The inside of the dialysis center at the Eastern Visayas Medical Center on Monday (July 21, 2025). The expanded benefits of the national government for hemodialysis patients have provided financial relief to poor patients and their families. (PNA photo by Sarwell Meniano)\n\nTACLOBAN CITY – For a family that earns PHP200 daily from peddling food, it is impossible for any of its members to get di...",
    "predicted_label": "Fake",
    "actual_label": "Real",
    "confidence": 0.55,
    "user_comment": "",
    "processed_text": "expand benefit eas burden region dialysi patient philippin news agenc expand benefit eas burden region dialysi patient philippin news agenc expand coverag insid dialysi center eastern visaya medic center monday juli expand benefit nation govern hemodialysi patient provid financi relief poor patient famili pna photo sarwel meniano tacloban citi famili earn php daili peddl food imposs member get di",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  },
  {
    "timestamp": "2025-07-26T22:35:12.199997",
    "text": "MMC regulations on use of e-trikes to include definitive penalties | Philippine News Agency MMC regulations on use of e-trikes to include definitive penalties | Philippine News Agency E-trikes in Tondo, Manila (PNA photo by Yancy Lim)\n\nMANILA – The Metro Manila Council is set to release a resolution regulating the use of electric motor vehicles, especially along major thoroughfares.Metropolitan Manila Development Authority Director Victor Nuñez of the Traffic Enforcement Group said Friday that the resolution, up for discussion and approval next week, would include fines and penalties i...",
    "predicted_label": "Fake",
    "actual_label": "Real",
    "confidence": 0.62,
    "user_comment": "",
    "processed_text": "mmc regul use etrik includ definit penalti philippin news agenc mmc regul use etrik includ definit penalti philippin news agenc etrik tondo manila pna photo yanci lim manila metro manila council set releas resolut regul use electr motor vehicl especi along major thoroughfaresmetropolitan manila develop author director victor nuez traffic enforc group said friday resolut discuss approv next week would includ fine penalti",
    "used_for_training": true,
    "training_date": "2025-07-26T22:46:20.145375"
  }
]